{"class_name": "Functional", "config": {"name": "model", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 300], "dtype": "string", "sparse": false, "ragged": false, "name": "input_1"}, "name": "input_1", "inbound_nodes": []}, {"class_name": "Lambda", "config": {"name": "lambda", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAcAAABDAAAAczQAAAB0AHQBoAJ0AaADfAB0AWoEoQKhAXQBoAV0BnQHZwEU\nAKEBZAGcAmQCZANkBI0DZAUZAFMAKQZOKQLaBnRva2Vuc9oMc2VxdWVuY2VfbGVucgEAAABUKQPa\nBmlucHV0c9oJc2lnbmF0dXJl2gdhc19kaWN0WgRlbG1vKQjaCmVsbW9fbW9kZWzaAnRm2gdzcXVl\nZXpl2gRjYXN02gZzdHJpbmfaCGNvbnN0YW502gpiYXRjaF9zaXpl2gdtYXhfbGVuKQHaAXipAHIP\nAAAA+h8vdG1wL2lweWtlcm5lbF8xOC80MjI0NTk2MjMwLnB52g1FbG1vRW1iZWRkaW5nAQAAAHMI\nAAAAAAEUARIBAgE=\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": [null, 1024], "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}, "name": "dropout", "inbound_nodes": [[["lambda", 0, 0, {}]]]}, {"class_name": "Bidirectional", "config": {"name": "bidirectional", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "lstm", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 512, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}, "shared_object_id": 3}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}, "shared_object_id": 4}, "bias_initializer": {"class_name": "Zeros", "config": {}, "shared_object_id": 5}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.35, "implementation": 1}}, "merge_mode": "concat"}, "name": "bidirectional", "inbound_nodes": [[["dropout", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "config": {"name": "time_distributed", "trainable": true, "dtype": "float32", "layer": {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 17, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}, "name": "time_distributed", "inbound_nodes": [[["bidirectional", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["time_distributed", 0, 0]]}, "keras_version": "2.6.0", "backend": "tensorflow"}